Show / Hide Table of Contents
Class IdeaStatiCaAppClient
Inheritance
System.Object
System.ServiceModel.ClientBase<IIdeaStaticaApp>
IdeaStatiCaAppClient
Implements
System.ServiceModel.ICommunicationObject
System.IDisposable
IIdeaStaticaApp
Inherited Members
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.GetDefaultValueForInitialization<T>()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.Open()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.Abort()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.Close()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.DisplayInitializationUI()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.CreateChannel()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.IDisposable.Dispose()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Open(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Close(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.BeginClose(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.BeginClose(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.EndClose(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.BeginOpen(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.BeginOpen(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.EndOpen(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.InvokeAsync(System.ServiceModel.ClientBase.BeginOperationDelegate<>, System.Object[], System.ServiceModel.ClientBase.EndOperationDelegate<>, System.Threading.SendOrPostCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.Channel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.CacheSetting
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.ChannelFactory
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.ClientCredentials
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.State
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.InnerChannel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.Endpoint
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Closed
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Closing
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Faulted
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Opened
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IIdeaStaticaApp>.System.ServiceModel.ICommunicationObject.Opening
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class IdeaStatiCaAppClient : ClientBase<IIdeaStaticaApp>, ICommunicationObject, IDisposable, IIdeaStaticaApp
Constructors
Improve this Doc   View Source
IdeaStatiCaAppClient(String)
Declaration
public IdeaStatiCaAppClient(string id)
Parameters
 Type |  Name |  Description
 System.String |  id
Properties
Improve this Doc   View Source
Service
Declaration
protected IIdeaStaticaApp Service { get; }
Property Value
 Type |  Description
 IIdeaStaticaApp
Methods
Improve this Doc   View Source
GetAllConnectionData(Int32)
Declaration
public string GetAllConnectionData(int connectionId)
Parameters
 Type |  Name |  Description
 System.Int32 |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetConnectionModel(Int32)
Declaration
public ConnectionData GetConnectionModel(int connectionId)
Parameters
 Type |  Name |  Description
 System.Int32 |  connectionId
Returns
 Type |  Description
 ConnectionData
Improve this Doc   View Source
GetCssInMPRL(CountryCode)
Declaration
public List<LibraryItem> GetCssInMPRL(CountryCode countryCode)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
Returns
 Type |  Description
 System.Collections.Generic.List<LibraryItem>
Improve this Doc   View Source
GetCssInProject()
Declaration
public List<ProjectItem> GetCssInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Improve this Doc   View Source
GetMaterialsInMPRL(CountryCode)
Declaration
public List<LibraryItem> GetMaterialsInMPRL(CountryCode countryCode)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
Returns
 Type |  Description
 System.Collections.Generic.List<LibraryItem>
Improve this Doc   View Source
GetMaterialsInProject()
Declaration
public List<ProjectItem> GetMaterialsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Implements
 System.ServiceModel.ICommunicationObject
 System.IDisposable
 IIdeaStaticaApp
 Improve this Doc
 View Source